In [27]:
#!pip install pymysql
#!pip install sqlalchemy

In [28]:
import pandas as pd
import numpy as np

import pymysql                        # for getting data from a SQL database
from sqlalchemy import create_engine  # for establishing the connection and authentication

from getpass import getpass     # To get the password without showing the input

In [29]:
password = getpass()

········

In [30]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

In [31]:
type(engine)

sqlalchemy.engine.base.Engine

In [32]:
# 1.How many distinct (different) actors' last names are there?
query = '''SELECT COUNT(DISTINCT last_name) AS distinct_actor FROM sakila.actor;'''
print(query)
distinct_actor = pd.read_sql_query(query, engine)
distinct_actor

SELECT COUNT(DISTINCT last_name) AS distinct_actor FROM sakila.actor;

   distinct_actor
0             121

In [33]:
# 2.Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.
query = '''SELECT *, 
CASE 
WHEN DATE_FORMAT(rental_date,'%%a') = 'Sat' then 'Weekend'
WHEN DATE_FORMAT(rental_date,'%%a') = 'Sun' then 'Weekend'
ELSE 'Weekday'
END AS day_type
 FROM sakila.rental;'''
print(query)
data2 = pd.read_sql_query(query, engine)
data2

SELECT *,
CASE
WHEN DATE_FORMAT(rental_date,'%%a') = 'Sat' then 'Weekend'
WHEN DATE_FORMAT(rental_date,'%%a') = 'Sun' then 'Weekend'
ELSE 'Weekday'
END AS day_type
 FROM sakila.rental;

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,day_type
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,Weekday
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,Weekday
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,Weekday
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,Weekday
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,Weekday
...,...,...,...,...,...,...,...,...
16039,16045,2005-08-23 22:25:26,772,14,2005-08-25 23:54:26,1,2006-02-15 21:30:53,Weekday
16040,16046,2005-08-23 22:26:47,4364,74,2005-08-27 18:02:47,2,2006-02-15 21:30:53,Weekday
16041,16047,2005-08-23 22:42:48,2088,114,2005-08-25 02:48:48,2,2006-02-15 21:30:53,Weekday
16042,16048,2005-08-23 22:43:07,2019,103,2005-08-31 21:33:07,1,2006-02-15 21:30:53,Weekday
16043,16049,2005-08-23 22:50:12,2666,393,2005-08-30 01:01:12,2,2006-02-15 21:30:53,Weekday

In [34]:
#3.Get all films with ARMAGEDDON in the title.
query3 = '''SELECT title AS film FROM sakila.film
WHERE title LIKE '%%ARMAGEDDON%%';'''
print(query3)
data3 = pd.read_sql_query(query3, engine)
data3

SELECT title AS film FROM sakila.film
WHERE title LIKE '%%ARMAGEDDON%%';

                    film
0        ARMAGEDDON LOST
1    LADYBUGS ARMAGEDDON
2       METAL ARMAGEDDON
3    MOSQUITO ARMAGEDDON
4  STAGECOACH ARMAGEDDON
5      STEERS ARMAGEDDON

In [35]:
# 4.Get 10 the longest films.
query4 = '''SELECT title AS film FROM sakila.film
ORDER BY length DESC
LIMIT 10;'''
print(query4)
data4 = pd.read_sql_query(query4, engine)
data4

SELECT title AS film FROM sakila.film
ORDER BY length DESC
LIMIT 10;

                 film
0      DARN FORRESTER
1        POND SEATTLE
2       CHICAGO NORTH
3       MUSCLE BRIGHT
4        WORST BANGER
5         GANGS PRIDE
6  SOLDIERS EVOLUTION
7           HOME PITY
8   SWEET BROTHERHOOD
9      CONTROL ANTHEM

In [36]:
# 5.How many films include Behind the Scenes content?
query5 = '''SELECT COUNT(film_id) AS number_B FROM sakila.film
WHERE special_features LIKE '%%Behind the Scenes%%';'''
print(query5)
data5 = pd.read_sql_query(query5, engine)
data5

SELECT COUNT(film_id) AS number_B FROM sakila.film
WHERE special_features LIKE '%%Behind the Scenes%%';

   number_B
0       538

In [37]:
# 6.Which kind of movies (rating) have a mean duration of more than two hours?
query6 = '''SELECT rating, AVG(length) AS mean_duration FROM sakila.film
GROUP BY rating
HAVING mean_duration > 120;'''
print(query6)
data6 = pd.read_sql_query(query6, engine)
data6

SELECT rating, AVG(length) AS mean_duration FROM sakila.film
GROUP BY rating
HAVING mean_duration > 120;

  rating  mean_duration
0  PG-13       120.4439

In [40]:
# 7.Rank films by length (filter out the rows that have nulls or 0s in length column). 
# In your output, only select the columns title, length, and the rank.
query7 = '''SELECT title, length, RANK() OVER (ORDER BY Length DESC) AS 'Rank' FROM sakila.film
WHERE length IS NOT NULL
ORDER BY length DESC;'''
print(query7)
data7 = pd.read_sql_query(query7, engine)
data7

SELECT title, length, RANK() OVER (ORDER BY Length DESC) AS 'Rank' FROM sakila.film
WHERE length IS NOT NULL
ORDER BY length DESC;

                   title  length  Rank
0          CHICAGO NORTH     185     1
1         CONTROL ANTHEM     185     1
2         DARN FORRESTER     185     1
3            GANGS PRIDE     185     1
4              HOME PITY     185     1
..                   ...     ...   ...
995         ALIEN CENTER      46   996
996            IRON MOON      46   996
997        KWAI HOMEWARD      46   996
998     LABYRINTH LEAGUE      46   996
999  RIDGEMONT SUBMARINE      46   996

[1000 rows x 3 columns]

In [39]:
data.isna().sum()

distinct_actor    0
dtype: int64